Revit 2024 API
BuiltInFailures.RebarCouplerFailures Class
 Failures concerning couplers
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class RebarCouplerFailures
Visual Basic
Public NotInheritable Class RebarCouplerFailures
Visual C++
public ref class RebarCouplerFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures
See Also
BuiltInFailures.RebarCouplerFailures Members
Autodesk.Revit.DB Namespace